notes/2019-SC-BoF.tex
% Created 2019-11-06 Wed 19:50
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{lmodern}
\usetheme{default}
\date{November 20, 2019}
\title{Functionality Slices Working Group}
\hypersetup{
 pdfauthor={},
 pdftitle={Functionality Slices Working Group},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\begin{frame}[label={sec:org367b03c}]{Executive Summary}
\begin{itemize}
\item \alert{Problem:} Given the size and structure of the PMIx standard document, it can be difficult to find the PMIx components necessary for a given use-case
\item \alert{Goal:} Provide a mechanism for focusing in on the aspects of the standard that are of interest to a particular user/use-case
\item \alert{Proposed solution:} compile a list of high-level use-cases and the PMIx capabilities required to support them
\begin{itemize}
\item Answer the question: "To do \uline{\_\_} with PMIx, what interfaces should I use and my resource manager support?"
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org614605e}]{Goals}
\begin{block}{Short-term:}
\begin{itemize}
\item Use-Case Milestone 1 (Jan 2020):
\begin{itemize}
\item bootstrap (business card exchange)
\item debuggers / tools
\end{itemize}
\item Use-Case Milestone 2 (Q1/Q2 2020):
\begin{itemize}
\item hybrid programming models
\item instant-on
\item workflow/application management
\end{itemize}
\end{itemize}
\end{block}
\begin{block}{Long-term:}
\begin{itemize}
\item Add interfaces for querying "use-case support"
\item Identify and document emerging use-cases
\begin{itemize}
\item cross-version compatibility
\item fault tolerance
\item groups/flexible allocations
\item power control
\item tiered storage
\end{itemize}
\end{itemize}
\end{block}
\end{frame}
\begin{frame}[label={sec:org71aff84}]{Call for Participation}
\begin{block}{Help Wanted}
\begin{itemize}
\item Identifying use-cases that we’ve missed
\item Reviewing documented use-cases
\item Documenting identified use-cases
\end{itemize}
\end{block}
\begin{block}{How to Join}
\begin{itemize}
\item Subscribe to our Google Group mailing list
\begin{itemize}
\item \href{https://groups.google.com/forum/\#!forum/pmix-forum-wg-func-slices}{\alert{{\color{blue}\underline{pmix-forum-wg-func-slices}}}}
\end{itemize}
\item Weekly call
\begin{itemize}
\item Wednesdays @ 9am PT / 12pm ET
\item Webex info sent via mailing list
\item Email me for a calendar invite (herbein1@llnl.gov)
\end{itemize}
\end{itemize}
\end{block}
\end{frame}
\end{document}